nxp-mcuxpresso/mcux-soc-svd/MCXC244/MCXC244.xml
                  <description>Pin is configured as general-purpose output, for the GPIO function.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDD27</name>
              <description>Port Data Direction</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b00000000000000000000000000000000</name>
                  <description>Pin is configured as general-purpose input, for the GPIO function.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b00000000000000000000000000000001</name>
                  <description>Pin is configured as general-purpose output, for the GPIO function.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDD28</name>
              <description>Port Data Direction</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b00000000000000000000000000000000</name>
                  <description>Pin is configured as general-purpose input, for the GPIO function.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b00000000000000000000000000000001</name>
                  <description>Pin is configured as general-purpose output, for the GPIO function.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDD29</name>
              <description>Port Data Direction</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b00000000000000000000000000000000</name>
                  <description>Pin is configured as general-purpose input, for the GPIO function.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b00000000000000000000000000000001</name>
                  <description>Pin is configured as general-purpose output, for the GPIO function.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDD30</name>
              <description>Port Data Direction</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b00000000000000000000000000000000</name>
                  <description>Pin is configured as general-purpose input, for the GPIO function.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b00000000000000000000000000000001</name>
                  <description>Pin is configured as general-purpose output, for the GPIO function.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDD31</name>
              <description>Port Data Direction</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b00000000000000000000000000000000</name>
                  <description>Pin is configured as general-purpose input, for the GPIO function.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b00000000000000000000000000000001</name>
                  <description>Pin is configured as general-purpose output, for the GPIO function.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIOB</name>
      <description>General Purpose Input/Output</description>
      <groupName>GPIO</groupName>
      <prependToName>GPIOB_</prependToName>
      <baseAddress>0x400FF040</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x18</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PDOR</name>
          <description>Port Data Output Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDO0</name>
              <description>Port Data Output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b00000000000000000000000000000000</name>
                  <description>Logic level 0 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b00000000000000000000000000000001</name>
                  <description>Logic level 1 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO1</name>
              <description>Port Data Output</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b00000000000000000000000000000000</name>
                  <description>Logic level 0 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b00000000000000000000000000000001</name>
                  <description>Logic level 1 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO2</name>
              <description>Port Data Output</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b00000000000000000000000000000000</name>
                  <description>Logic level 0 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b00000000000000000000000000000001</name>
                  <description>Logic level 1 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO3</name>
              <description>Port Data Output</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b00000000000000000000000000000000</name>
                  <description>Logic level 0 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b00000000000000000000000000000001</name>
                  <description>Logic level 1 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO4</name>
              <description>Port Data Output</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b00000000000000000000000000000000</name>
                  <description>Logic level 0 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b00000000000000000000000000000001</name>
                  <description>Logic level 1 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO5</name>
              <description>Port Data Output</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b00000000000000000000000000000000</name>
                  <description>Logic level 0 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b00000000000000000000000000000001</name>
                  <description>Logic level 1 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO6</name>
              <description>Port Data Output</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b00000000000000000000000000000000</name>
                  <description>Logic level 0 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b00000000000000000000000000000001</name>
                  <description>Logic level 1 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO7</name>
              <description>Port Data Output</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b00000000000000000000000000000000</name>
                  <description>Logic level 0 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b00000000000000000000000000000001</name>
                  <description>Logic level 1 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO8</name>
              <description>Port Data Output</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b00000000000000000000000000000000</name>
                  <description>Logic level 0 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b00000000000000000000000000000001</name>
                  <description>Logic level 1 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO9</name>
              <description>Port Data Output</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b00000000000000000000000000000000</name>
                  <description>Logic level 0 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b00000000000000000000000000000001</name>
                  <description>Logic level 1 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO10</name>
              <description>Port Data Output</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b00000000000000000000000000000000</name>
                  <description>Logic level 0 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b00000000000000000000000000000001</name>
                  <description>Logic level 1 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO11</name>
              <description>Port Data Output</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b00000000000000000000000000000000</name>
                  <description>Logic level 0 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b00000000000000000000000000000001</name>
                  <description>Logic level 1 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO12</name>
              <description>Port Data Output</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b00000000000000000000000000000000</name>
                  <description>Logic level 0 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b00000000000000000000000000000001</name>
                  <description>Logic level 1 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO13</name>
              <description>Port Data Output</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b00000000000000000000000000000000</name>
                  <description>Logic level 0 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b00000000000000000000000000000001</name>
                  <description>Logic level 1 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO14</name>
              <description>Port Data Output</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b00000000000000000000000000000000</name>
                  <description>Logic level 0 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b00000000000000000000000000000001</name>
                  <description>Logic level 1 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO15</name>
              <description>Port Data Output</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b00000000000000000000000000000000</name>
                  <description>Logic level 0 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b00000000000000000000000000000001</name>
                  <description>Logic level 1 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO16</name>
              <description>Port Data Output</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b00000000000000000000000000000000</name>
                  <description>Logic level 0 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b00000000000000000000000000000001</name>
                  <description>Logic level 1 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO17</name>
              <description>Port Data Output</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b00000000000000000000000000000000</name>
                  <description>Logic level 0 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b00000000000000000000000000000001</name>
                  <description>Logic level 1 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO18</name>
              <description>Port Data Output</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b00000000000000000000000000000000</name>
                  <description>Logic level 0 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b00000000000000000000000000000001</name>
                  <description>Logic level 1 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO19</name>
              <description>Port Data Output</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b00000000000000000000000000000000</name>
                  <description>Logic level 0 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b00000000000000000000000000000001</name>
                  <description>Logic level 1 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO20</name>
              <description>Port Data Output</description>
